/*
מסך התחקור/ניהול הקלטות:
מסך זה ניתן לגישה עבור מנהלים בלבד.
במסך התחקור למנהל יש אפשרות לגשת להקלטות שבוצעו במהלך השיחות ושנשמרו בשרת.
מצד ימין תוכל לראות את רשימת ההקלטות השמורות בשרת. בהקשה על הקלטה ברשימה ההקלטה תיטען מהשרת ויוצגו לך פרטים מורחבים על ההקלטה ביניהם שם ההקלטה, תצוגת גל של ההקלטה משך זמן ההקלטה וכו' . ניתן להפעיל את ההקלטה ע"י לחיצה על כפתור ההפעלה ולשלוט בהפעלה ע"י קפיצה לזמן מסוים בהקלטה, דילוג 5 שניות בהקלטה קדימה או אחורה ושינוי מהירות ההשמעה. בחלון זה ניתנת אפשרות נוספת לבדיקת ההקלטה – ניתן לסנן את רעשי הרקע שבוצעו במהלך השיחה, לקבל גם גרף FFT של ההקלטה להצגת מרחב התדרים של השיחה ולבצע חישוב חוזר של IFFT להחזרת ההקלטה למרחב הזמן המקורי שלה.
במסך התחקור יש בנוסף תפריט קטן המופיע למעלה בו ניתן לבצע פעולות נוספות במסך. ניתן למשל להעלות הקלטות חדשות לשרת ישירות מהמחשב ולהריצם לאחר מכן במסך.
*/

import classes from './modalContent.module.css';

const info = () => (
    <div className={classes.modalContent} style={{direction: 'rtl'}}>
        <h1><b>מדריך למשתמש:</b></h1>
        <p>
        מסך זה ניתן לגישה עבור מנהלים בלבד.
במסך התחקור למנהל יש אפשרות לגשת להקלטות שבוצעו במהלך השיחות ושנשמרו בשרת.
מצד ימין תוכל לראות את רשימת ההקלטות השמורות בשרת. בהקשה על הקלטה ברשימה ההקלטה תיטען מהשרת ויוצגו לך פרטים מורחבים על ההקלטה ביניהם שם ההקלטה, תצוגת גל של ההקלטה משך זמן ההקלטה וכו' . ניתן להפעיל את ההקלטה ע"י לחיצה על כפתור ההפעלה ולשלוט בהפעלה ע"י קפיצה לזמן מסוים בהקלטה, דילוג 5 שניות בהקלטה קדימה או אחורה ושינוי מהירות ההשמעה. בחלון זה ניתנת אפשרות נוספת לבדיקת ההקלטה – ניתן לסנן את רעשי הרקע שבוצעו במהלך השיחה, לקבל גם גרף FFT של ההקלטה להצגת מרחב התדרים של השיחה ולבצע חישוב חוזר של IFFT להחזרת ההקלטה למרחב הזמן המקורי שלה.
במסך התחקור יש בנוסף תפריט קטן המופיע למעלה בו ניתן לבצע פעולות נוספות במסך. ניתן למשל להעלות הקלטות חדשות לשרת ישירות מהמחשב ולהריצם לאחר מכן במסך.
        </p>
    </div>
);

export default info;